<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Series-删除索引对应的值" data-toc-modified-id="Series-删除索引对应的值-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Series 删除索引对应的值</a></span></li><li><span><a href="#DataFrame-删除对应的行或列" data-toc-modified-id="DataFrame-删除对应的行或列-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>DataFrame 删除对应的行或列</a></span></li><li><span><a href="#传入inplace=True-原地修改" data-toc-modified-id="传入inplace=True-原地修改-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>传入inplace=True 原地修改</a></span></li></ul></div>

drop() 返回一个含有指示值或轴向上删除值的新对象

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Series 删除索引对应的值

In [2]:
obj = Series(np.arange(5.), index=list('abcde'))

In [3]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [4]:
new_obj = obj.drop('c') # 删除'c'索引对应的值

In [5]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [6]:
obj.drop(['d', 'c']) # 删除'd'和'c'索引对应的值

a    0.0
b    1.0
e    4.0
dtype: float64

## DataFrame 删除对应的行或列

In [7]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [8]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
data.drop(['Colorado', 'Ohio']) # 删除'Colorado'和'Ohio'行

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
data.drop(['Colorado', 'Ohio'], axis=0) # 删除'Colorado'和'Ohio'行

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [11]:
data.drop('two', axis=1) # 删除'two'列

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [12]:
data.drop('two', axis='columns') # 删除'two'列

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [13]:
data.drop(['two', 'four'], axis='columns') # 删除'two'和'four'列

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## 传入inplace=True 原地修改

In [14]:
obj.drop('c', inplace=True) # 删除'c'索引对应的值，原地修改

In [15]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64